---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.SpaceSet.GetEnumerator
source: html/f80fe785-f724-4279-9f38-c7a74993f69e.htm
---
# Autodesk.Revit.DB.Mechanical.SpaceSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.